app/controllers/commentaires_controller.rb

  def index
    @commentaires = Commentaire.all
---
SELECT "commentaires".* FROM "commentaires"

  def new
    @commentaire = Commentaire.new
    @commentaire.post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @commentaire = Commentaire.new(commentaire_params)
    if @commentaire.save
---
INSERT INTO "commentaires" ("auteur", "contenu", "created_at", "date", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["auteur", "Giudice"], ["contenu", "edzezf"], ["created_at", "2018-02-01 10:29:16.589780"], ["date", "2018-02-01"], ["post_id", 1], ["updated_at", "2018-02-01 10:29:16.589780"]]

  def destroy
    @commentaire.destroy
---
DELETE FROM "commentaires" WHERE "commentaires"."id" = ?  [["id", 1]]

    def set_commentaire
      @commentaire = Commentaire.find(params[:id])
---
SELECT  "commentaires".* FROM "commentaires"  WHERE "commentaires"."id" = ? LIMIT 1  [["id", 1]]