app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts"[0

  def show
    @users = User.all
    @commentaires = Commentaire.all
---
SELECT "users".* FROM "users"
SELECT "commentaires".* FROM "commentaires"

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("chapeau", "created_at", "date", "nomAuteur", "titre", "updated_at", "vignette") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ?, "vignette" = ? WHERE "posts"."id" = 3  [["updated_at", "2018-01-30 10:29:36.203999"], ["vignette", "AAEAAQAAAAAAAAeAAAAAJDA5MGNiNTZmLTcxM2UtNGVhYS04M2U5LTZkZWRiODVhZGFhYg.jpg"]]