app/controllers/users_controller.rb

  def show
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "nom", "prenom", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2018-01-30 08:39:39.297992"], ["email", ""], ["nom", ""], ["prenom", ""], ["updated_at", "2018-01-30 08:39:39.297992"]]